In [2]:
import pandas as pd
import numpy as np

peaks_data = pd.read_csv("./data/peaks.csv")
expe_data = pd.read_csv("./data/expeditions.csv")
memb_data = pd.read_csv("./data/members.csv")

# 1. Peaks

In [4]:
#Finding the proportion of peaks unclimbed 
import pandas as pd
peaks_data = pd.read_csv("./data/peaks.csv")
peaks_data["climbing_status"].value_counts(normalize=True)

Climbed      0.728632
Unclimbed    0.271368
Name: climbing_status, dtype: float64

Answer 1.a) The proportion of unclimbed peaks is 27.13%

In [5]:
#Finding the average height in meters of climbed peaks
climbed_peaks = peaks_data[peaks_data["climbing_status"] == "Climbed"]
unclimbed_peaks = peaks_data [peaks_data["climbing_status"] == "Unclimbed"]
climbed_peaks["height_metres"].mean()

6706.284457478006

In [63]:
#Finding the average height of unclimbed peaks
unclimbed_peaks["height_metres"].mean()

6523.330708661418

Answer 1.b) The average height in meters of climbed peaks is 6,706
            The average height in meters of unclimbed peaks is 6,523

# 2. Sherpas

In [8]:
#Finding the proportion of Nepalese hired
import pandas as pd
memb_data = pd.read_csv("./data/members.csv")

memb_data_Nepalese = memb_data[memb_data["citizenship"] == "Nepal"] 
memb_data_Nepalese["hired"].value_counts(normalize=True)

True     0.934056
False    0.065944
Name: hired, dtype: float64

Answer 2.a) The proportion of Nepalese hired for the expedition is 93.40%

In [11]:
memb_data_Nepalese["age"].min()

12.0

In [10]:
memb_data_Nepalese["age"].max()

85.0

In [98]:
memb_data_Nepalese["age"].mean()

32.88506226953315

Answer 2.b) The minumin age of Nepalese citizens in the "members" dataset is 12 Years old, the maximum age is 85 years old and the average age is 32.88 years old.

# 3. Gender

In [13]:
#Join the data sets
import pandas as pd 
expe_data = pd.read_csv("./data/expeditions.csv")

ev_join = peaks_data.merge(expe_data, left_on = "peak_id", right_on = "peak_id").merge(memb_data, left_on = "expedition_id", right_on = "expedition_id")
nonhired = ev_join[ev_join["hired"] ==False]

Answer 3.a

In [13]:
fem_climbed = nonhired[(nonhired["sex"]=="F")&(nonhired["success"]==True)]
fem_climbed.head()

,peak_id_x,peak_name_x,peak_alternative_name,height_metres,climbing_status,first_ascent_year,first_ascent_country,first_ascent_expedition_id,expedition_id,peak_name_y,...,highpoint_metres_y,success,solo,oxygen_used_y,died,death_cause,death_height_metres,injured,injury_type,injury_height_metres
24,AMAD,Ama Dablam,Amai Dablang,6814,Climbed,1961.0,"New Zealand, USA, UK",AMAD61101,AMAD88402,Ama Dablam,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
34,AMAD,Ama Dablam,Amai Dablang,6814,Climbed,1961.0,"New Zealand, USA, UK",AMAD61101,AMAD83301,Ama Dablam,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
45,AMAD,Ama Dablam,Amai Dablang,6814,Climbed,1961.0,"New Zealand, USA, UK",AMAD61101,AMAD83301,Ama Dablam,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
61,AMAD,Ama Dablam,Amai Dablang,6814,Climbed,1961.0,"New Zealand, USA, UK",AMAD61101,AMAD83302,Ama Dablam,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
177,AMAD,Ama Dablam,Amai Dablang,6814,Climbed,1961.0,"New Zealand, USA, UK",AMAD61101,AMAD87401,Ama Dablam,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN

In [15]:
first_wm = fem_climbed.nsmallest(1,"year_y", keep="all")
first_wm

,peak_id_x,peak_name_x,peak_alternative_name,height_metres,climbing_status,first_ascent_year,first_ascent_country,first_ascent_expedition_id,expedition_id,peak_name_y,...,highpoint_metres_y,success,solo,oxygen_used_y,died,death_cause,death_height_metres,injured,injury_type,injury_height_metres
73009,TENG,Tengkoma,Tang Kongma,6215,Climbed,1949.0,"Switzerland, Nepal",TENG49101,TENG49101,Tengkoma,...,6215.0,True,False,False,False,NaN,NaN,False,NaN,NaN
73506,DZAN,Dzanye,Dzanaye,6581,Climbed,1949.0,Switzerland,DZAN49101,DZAN49101,Dzanye,...,6719.0,True,False,False,False,NaN,NaN,False,NaN,NaN

Answer 3.b

In [18]:
# Finding the proportion of success in summitting a main peak or sub-peak and participants who died 
ev_join = peaks_data.merge(expe_data, left_on = "peak_id", right_on = "peak_id").merge(memb_data, left_on = "expedition_id", right_on = "expedition_id")
ev_join.groupby(["sex", "died"])["success"].value_counts(normalize=True)

sex  died   success
F    False  False      0.672291
            True       0.327709
     True   False      0.720000
            True       0.280000
M    False  False      0.610329
            True       0.389671
     True   False      0.787879
            True       0.212121
Name: success, dtype: float64

# 4. Accidents

In [41]:
#df_decade = expe_data.groupby(expe_data["year"])

expe_data.index = pd.to_datetime(expe_data.index)
year_index = expe_data.index.to_period('Y')


df_decade = expe_data.groupby(expe_data.year_index.year).sum().head()

df_decade

AttributeError: 'DataFrame' object has no attribute 'year_index'